{
    "Space System (UTAT division) and FINCH mission overview": "Space Systems — University of Toronto Aerospace Team\n0\nSkip to Content\nHome\nDivisions\nRocketry\nSpace Systems\nUnmanned Aerial Systems\nAerospace Policy\nPortfolios\nBusiness Development\nOutreach\nFinances\nOrganizational Development\nBrand and Media\nPartners\nSponsors\nCollaborators\nExecutive Team\nAbout Us\nContact Us\nRedefining Limits\nArticles\nGet Involved\nOpen Menu\nClose Menu\nHome\nDivisions\nRocketry\nSpace Systems\nUnmanned Aerial Systems\nAerospace Policy\nPortfolios\nBusiness Development\nOutreach\nFinances\nOrganizational Development\nBrand and Media\nPartners\nSponsors\nCollaborators\nExecutive Team\nAbout Us\nContact Us\nRedefining Limits\nArticles\nGet Involved\nOpen Menu\nClose Menu\nHome\nFolder:\nDivisions\nFolder:\nPortfolios\nFolder:\nPartners\nExecutive Team\nFolder:\nAbout Us\nGet Involved\nBack\nRocketry\nSpace Systems\nUnmanned Aerial Systems\nAerospace Policy\nBack\nBusiness Development\nOutreach\nFinances\nOrganizational Development\nBrand and Media\nBack\nSponsors\nCollaborators\nBack\nContact Us\nRedefining Limits\nArticles\nSpace Systems\nThe Space Systems division builds and launches CubeSats for scientific missions - our main goal is to provide educational opportunities to students in spacecraft design, assembly, testing, operation, mission planning and leadership.\nWe are passionate about designing systems that test novel designs, address scientific gaps, and help life on Earth improve. Our designs are open-source for other teams to improve on; our division is fully student-funded the University of Toronto Engineering Society (EngSoc).\nUTAT Space Systems is a no-barrier team - we recruit from all engineering disciplines and from other faculties as well, to pull together a wide knowledge base. We believe in giving members ownership of their works, and making sure that our members contribute uniquely to our missions.\nProject Overview\nFINCH\nThe\nField Imaging Nanosatellite for Crop residue Hyperspectral mapping\n(FINCH)\nmission is a 3U CubeSat mission designed to conduct a technological demonstration of crop residue mapping from the Low-Earth Orbit.\nThe two primary goals for this mission are:\nPerforming a technological demonstration of the first Volume Phase Holographic (VPH) grism in a small form-factor\nProviding a proof of concept for crop residue mapping using hyperspectral short wave infrared\n(SWIR) satellite remote sensing\nSince 2020, the FINCH mission has gone through its mission scoping and high-level design phase. We are jumping into the detailed design phase now, full of rapid prototyping and proofs-of-concept in all areas of the team. FINCH is aiming to innovate with its novel payload design, and integrating high-performance components in all subsystems to make sure we get the best payload data we can.\nFINCH is projected to launch in Q3 2028.\nDevelopment Timeline for FINCH\n2019\n- FINCH Kickoff! The name of the satellite is chosen from the Satellite Idea Competition\n2020\n- Space Systems chooses a remote sensing mission profile. Mission scoping begins\nApril 2021\n- High-Level Design for FINCH begins\nMarch 2022\n- Detailed Design for FINCH begins\nHERON Mk. II\nThe Space Systems division is proud to present the\nHERON Mk. II\nsatellite, the first fully student-built and student-funded satellite in Canada.\nHERON Mk. II was launched and deployed into Sun-synchronous orbit on November 11th, 2023, during the SpaceX Transporter-9 mission aboard a Falcon 9 rocket.\nAs primarily an educational and self-training mission, there have been many learnings along the way—developing an amateur radio ground station, establishing robust design and testing practices, and much more. As a secondary mission, HERON will validate our open-source electronics and mechanical design.\nHERON’s mechanical design (MECH) includes a passive magnetic attitude control system, thermal insulation system, and standardized 3U CubeSat structural design. The main electronics design (BUS) includes an electrical power system with solar arrays, UHF band communication system, and on-board computer with custom firmware.\nIn 2021, the Space Systems division finished the development of the amateur radio satellite HERON in preparation for hand-off and launch. Since 2017, the team has been designing HERON as the team’s first-ever CubeSatellite in the hopes that future satellites and radio amateurs will use and modify our open-source designs.\nCurrently, the HERON project is focused on the launch and operations phase by coordinating with our launch provider and testing our own ground station. We are looking for members with programming experience, interest/experience in amateur radio communications, and an interest in spacecraft operations.\nHERON acts as a WORD on the UHF band and is available to amateur radio operators across the world.\nFor more details on the satellite project, please consult the link below:\nOur Website for HERON\nDevelopment Timeline for HERON Mk. II\n2016-2018 -\nSpace Systems designs and builds HERON Mk. II for the 4th edition of the Canadian Satellite Design Challenge.\n2017 -\nSpace Systems secures UTSU levy to fund launch of HERON Mk. II.\nJune 2018 -\nHERON Mk. II vibration testing conducted at DFL as part of CSDC.\n2019 -\nSpace Systems succeeds in getting UTSU levy renewed.\nFall 2019 -\nHERON Mk. II softstack takes place.\nFebruary 2020 -\nHERON Mk. II bakeout and TVAC conducted at MDA in Brampton, Ontario.\n2021 -\nSpace Systems succeeds in getting UTSU levy renewed a second time.\nMarch ~ April 2021 -\nHERON Mk. II final assembly (hardstack) takes place.\nJune 2021 -\nHERON Mk. II flight model vibration testing conducted at NTS in Kitchener, Ontario.\nOctober 2021 -\nMission objectives changed to emphasize educational objective, in order to increase team’s experience with amateur radio communications.\nSummer 2022 -\nHERON ground station assembly begins\nAugust 2023 -\nHERON Mk. II deployer integration in Bellevue, Washington.\nNovember 11th, 2023 -\nSpacebound! HERON Mk. II launches from Vandenberg Space Force Base on the SpaceX Transporter-9 rideshare mission aboard a Falcon 9 rocket.\nHERON Mk. I (Retired)\nDevelopment Timeline for HERON Mk. I\n2014-2016 -\nHERON Mk. I CubeSat developed and constructed\n2017 -\nPoster presentation at NASA AAQ in Huntsville, USA, followed by retirement of the demonstrator\nWhy Amateur Radio?\nA key educational objective for the HERON Mk. II mission is to provide amateur radio training and amateur satellite operations experience to our members. To this end, we have a training program for UTAT Space Systems members that makes significant use of the Amateur Basic and Advanced content. While this training is primarily for new Communications members, others on the team are welcome to participate. It is our goal that HERON will further the development of the amateur radio community in Toronto and beyond: our designs are publicly available, and amateur operators from around the world will be able to receive telemetry data from HERON as well as use our ground station via the SatNOGS network.\nNew members learn the basics of RF Communications starting with the knowledge required for Basic licensure, and pass the Amateur Radio exam so they can operate our amateur ground station and help design RF components under the guidance of the Communications lead. Keener members are encouraged to study for the Advanced licensure as this content is what they will learn over the course of the HERON and FINCH missions, and will allow them to further assist with communications in the amateur band using our ground station.\nTeams and Sub-teams\nFINCH Sub-teams\nSystems\nThe highway that links the team and the FINCH design. Manage design decisions and interfaces (points of connection) across FINCH using systems thinking, and making the assembly and testing plans for the satellite.\nScience\nThe role of the Science sub-team is to develop rigorous methods of validating design decisions which affect the Scientific value of the satellite. These methods involve forward model simulations, the development of data analysis pipelines (including machine learning), and close cooperation with our partners at the Agriculture and Agri-Foods Canada (AAFC) and EMILI Agriculture Innovation for ground truth campaigns each Spring and Fall\nMission Operations\nCollective of members who work together in collaboration with other subteams to establish how FINCH will work in space, and how that translates for the firmware, power, RF, electronics, and ADCS teams. We look at modes of operation and risk mitigation through FDIR/FMEA analysis to conduct a smooth mission.\nData Processing\nDevelop code in Python to correct various sources of noise in our data after it’s downlinked from FINCH.\nHardware\nDevelop the space-grade PCBs that will make FINCH work. From the schematic to board layout and testing, we design and test our boards in-house.\nFirmware & CDH\n(Command & Data Handling)\nWrite the code that keeps FINCH running. Working at a lower level than the software most people are familiar with, we build fast, reliable interfaces between power, the camera, sensors, actuators, radios, thermal, and more.\nRF\n(Radio Frequency)\nDesign and test the radio-frequency communications signal chain so we can command FINCH from the ground and pull data from the satellite.\nMechanical\nDevelop the satellite structure, ensuring everything fits and we follow the launch provider’s mass and volume requirements. Undertake vibration testing to ensure we can withstand the vibrations and forces that come with the launch!\nThermal\nProtect FINCH against the crazy thermal loads on orbit and hold each component at optimal temperatures to make the satellite work. Put the satellite through thermal vacuum testing to verify its operations in space!\nOpto-Mechanical\nOptimechanical is focused on the design of the hyperspectral imager housing, where the magic happens! It contains the Payload Electronics and Optics teams. Recommended for those who want to learn about many satellite functions working together, and contribute to a cutting-edge payload design for scientific and technological research.\nADCS\n(Attitude Determination and Control Systems)\nResponsible for ensuring the spacecraft is pointed in the correct direction at any given time, using a system of sensors, actuators, and algorithms.\nPower\nDesign and test the power generation, storage, and distribution circuits for FINCH.\nHow to Join\nSpace Systems accepts new members primarily during the first few weeks of September, January and May. To join during one of these primary onboarding cycles, please fill out the sign-up form linked below:\nSign-up Form\nFor any questions, or to join outside of primary onboarding times, please email the Director of Space Systems at\nspacesys@utat.ca\nNo applications or resumes are required!\nJust let us know what your interests are, and we will help you get onboard during the next recruitment cycle.\nSee Also\nOur Open-Source Work\nCheck out our brand new\nNotion workspace\n! We are currently migrating to Notion, so please be patient as we deploy our documentation constellation.\nEnter the Notion Workspace\nCheck out our Github\nOur Conference Publications\nK. Gwozdecky, and S. Dodge. “Alternative Launch Funding for Student Nanosatellite Missions,” in SmallSat, Logan, UT, 2018. [Online]. Available:\nhttps://digitalcommons.usu.edu/smallsat/2018/all2018/354/\nA. Haydaroglu, R. Howlader, A. N. Mukkala, K. Ren, and E. van Velzen. “Systems Engineering Challenges and Strategies in a Student Satellite Design Team: HERON – A Case Study,” in ISSE, Edinburgh, UK, 2019. [Online]. Available: 10.1109/ISSE46696.2019.8984595\nC. Chanen et al. “Inspiring the Next Generation: Challenges and Strategies for Onboarding and Retention in an Undergraduate CubeSat Design Team,” in SmallSat, Logan, UT, 2021. [Online]. Available:\nhttps://digitalcommons.usu.edu/smallsat/2021/all2021/17/\nA. Miles et al. “FINCH: A Blueprint for Accessible and Scientifically Valuable Remote Sensing Satellite Missions,” in SmallSat, Logan, UT, 2022. [Online]. Available:\nhttps://digitalcommons.usu.edu/smallsat/2022/all2022/88/\nD. Murdoch et al. “Hot & Cold: The FINCH Thermal Simulator,” in SmallSat, Logan, UT, 2023. [Online]. Available:\nhttps://digitalcommons.usu.edu/smallsat/2023/all2023/232/\nI. Vyse et al. “Beyond the Visible: Jointly Attending to Spectral and Spatial Dimensions with\nHSI-Diffusion for the FINCH Spacecraft,” in SmallSat, Logan, UT, 2024. [Online]. Available:\nhttps://digitalcommons.usu.edu/smallsat/2024/all2024/121/\nI. Shofman et al. “FINCH EYE: The Optical and Optomechanical Design of a GRISM-Based SWIR Hyperspectral Imaging Payload for a 3U CubeSat,” in SmallSat, Salt Lake City, UT, 2025. [Online]. Available:\nhttps://digitalcommons.usu.edu/smallsat/2025/all2025/64/\nFINCH Leadership\nKsenya Narkevich\nDirector of Space Systems\nBen Bornstein\nFINCH Systems Design Lead\nGauri Karajagi\nFINCH Project Manager\nEge Artan\nFINCH Science Lead\nIliya Shofman\nFINCH Optical Payload Design Lead\nMário Ghio Neto\nFINCH Payload Mechanical Design Lead\nSakeena Qureshi\nFINCH Mechanical Design Lead\nRiann Po\nFINCH Thermal Design Lead\nJenny Hwang\nFINCH ADCS Design Lead\nCoby Silayan\nFINCH Hardware & Electrical Design Lead\nRoshan Yan\nFINCH Power Design Lead\nSwarnava Ghosh\nFINCH RF Lead\nRiaab Zahid\nFINCH Mission Operations Lead\nAlex Apostolu\nFINCH Firmware Design Lead\nNooh Adnan\nFINCH Data Processing Lead\nHERON Leadership\nReid Sox-Harris\nHERON Mission Operations Lead\nDylan Vogel\nHERON Chief Systems Designer\nJaden Reimer\nHERON Power Design Lead\nEric van Velzen\nHERON Thermal Design Lead\nLorna Lan\nHERON Instrumentation Lead\nBruno Almeida\nHERON Software Lead\nAvinash Mukkala\nHERON Technical Advisor\nKimberly Ren\nHERON Technical Advisor\nSpace Systems Portfolios\nChristina Mai\nSpace Systems Co-Head of Regulatory\nSakeena Qureshi\nSpace Systems Co-Head of Regulatory\nHannah Chua\nSpace Systems Head of Outreach\nRiaab Zahid\nSpace Systems Head of Brand & Media\nNicolas Chernyakhovsky\nSpace Systems Head of Finance and Business Development\nCopyright © 2024\nUniversity of Toronto Aerospace Team\n410 King's College Road B740, Sandford Fleming Building\nToronto, ON M5S 3G8\ncontact@utat.ca\nTo navigate the map with touch gestures double-tap and hold your finger on the map, then drag the map.\n←\nMove left\n→\nMove right\n↑\nMove up\n↓\nMove down\n+\nZoom in\n-\nZoom out\nHome\nJump left by 75%\nEnd\nJump right by 75%\nPage Up\nJump up by 75%\nPage Down\nJump down by 75%\nKeyboard shortcuts\nMap Data\nMap data ©2025 Google\nMap data ©2025 Google\n200 m\nClick to toggle between metric and imperial units\nTerms\nReport a map error\nWebsite under development by the UTAT Brand and Media Portfolio",
    "FINCH Mission Handbook": "FINCH Mission Handbook\nJavaScript must be enabled in order to use Notion.\nPlease enable JavaScript to continue.\nSkip to content\nUTAT Space Systems\n...\nFINCH\nFINCH Mission Handbook\nGet Notion free\nFINCH Mission Handbook\nOverview\nThe Mission\nTeam\nArchitecture\nOverview\nOptics\nMechanical\nOpto-Mechanical\nADCS\nThermal\nElectrical\nPower\nFirmware\nCommand & Data Handling\nPayload Firmware\nMission Operations\nData Processing\nOverview\nThis short guide presents a quick and dirty introduction to the FINCH mission and the spacecraft we’re building to tackle the mission (spoilers, there are no birds involved). This guide is only updated during recruitment cycles. For the source truth of the design, refer to the\nRequirements\nor speak with the system leads.\nFor team-specific onboarding, refer to the onboarding materials on the\nTeams\nhomepages. For a more comprehensive breakdown of the FINCH mission, check out our\nFINCH Summer 2023 Critical Design Review\n.\nThe Mission\nThe FINCH mission objective is to conduct crop residue mapping over Canada. Crop residue mapping involves the use of remote sensing technology, such as satellites or drones, to collect data on the amount and distribution of plant material left in a field after harvest. This information is crucial for understanding soil health, managing agricultural waste, and optimizing sustainable farming practices [\nsrc\n].\nAt a high-level, the concept of operations for the FINCH mission is as follows:\nLaunch the satellite into Low Earth Orbit (LEO)\nTake pictures of crop fields in the Short-Wave Infrared Range (SWIR)\nDownlink those pictures to our mission control center\nProcess the images using a special algorithm (spectral mixture analysis, SMA) to distinguish areas of crop residue from soil and other materials in our images\nFINCH concept of operations\nALT\nBased on that mission profile, there are a number of scientific requirements we have to design our spacecraft and payload around:\nSpatial resolution: < 90m x 90m or as small as possible\nSpectral Resolution: < 10nm\nSpectral Range: 900 - 1700nm or as wide as possible\nSNR: > 30 or as large as possible\nAll requirements can be found in\nRequirements\n. Requirements drive all our design work on Space Systems. You can learn more about requirements here:\nRequirements Engineering\n.\nTeam\nSpace Systems is composed of several teams that are each responsible for the development of a specific mission system. We have five mission cores and their associated systems.\nFINCH team structure. See for latest:\nhttps://app.diagrams.net/#G12BaOC6FZubndbvEVJG0ntQMCYaRKnIIV\nALT\nThe diagram has no notion of a power hierarchy. While our responsibilities as technical leads vary in terms of breadth and depth, and our level of technical experience differs between our respective fields, we value each others opinions with equal weight. This is the kind of culture we have nurtured on Space Systems.\nAll teams can be accessed through the\nTeams\ndatabase.\nArchitecture\nLet’s go over the design of the spacecraft.\nOverview\nAllow us to introduce you to FINCH: FINCH is a 3U+\nCubeSat\ncarrying a novel hyperspectral imaging payload designed to conduct crop residue mapping over Canada.\nFINCH CAD V2023-08-26\nALT\nThe “+” in 3U+ is because we make use of the additional tuna can space provided by the CubeSat Design Specification (\nCubeSat Design Specification 14.1\n) for our attitude determination and control system (ADCS) module. One of the most important technical challenges we have to solve as an imaging mission (out of many) is achieving the high degree of pointing accuracy required, so we leverage a performant ADCS and novel payload design to achieve this.\nThis is a system block diagram that shows FINCH’s architecture at a high-level:\nFINCH systems architecture. See for latest:\nhttps://app.diagrams.net/#G1WX9SwAGlAm3Z5XkLx2Xr9eqT2i4Dqkhy\nALT\nA lot going on here, but don’t feel overwhelmed. Let’s break this down. The spacecraft is split into two regions: the spacecraft bus and the payload. The payload is responsible for acquiring images, while the spacecraft bus is responsible for managing the power, data, communication, attitude, temperature, and general survival of the spacecraft itself. Space is dangerous, so this makes our work extra tricky. But this challenge is what makes designing space systems fun. See\nSpace Environment\n.\nBelow is a diagram of the FINCH stackup, to relative scale.\nTo learn more about the architecture, see\nSystems\n.\nOptics\nOptics\nThe Optics team oversees all things light! We are responsible for designing, building, and testing our hyperspectral imaging payload:\nFINCH EYE: About, Prototypes\n. Our payload must capture light reflected off of our imaging site on Earth and do a little bit of light-bending before passing it on to our sensor. This is achieved via a foreoptic, slit, relay lenses, and\nVPH grism\n. Something cool to note is that when FINCH launches, this will be the world’s\nfirst\ngrism-based hyperspectral camera in a CubeSat form factor!\nThe payload design is driven by\nRequirements Model: Optics\nwhich trickle down from the scientific requirements of swath, spatial and spectral resolution, spectral range, Signal-to-Noise Ratio (SNR), optical performance metrics, and space conditions. Our design process involves requirement definition, tradeoff analyses in\nPython\n, optical modeling in\nZemax\n, component selection, benchtop prototyping and testing, and collaboration with subsystems including but not limited to\nPayload Mechanical\n,\nPayload Firmware\n, and\nThermal\n.\nMechanical\nMechanical\nThe mechanical team is responsible for the design and development of the satellite framework and structure (not including the payload). The satellite itself must be compact while safeguarding the structural integrity of its internal and external frames. Material selection, research, and analysis must be done on the satellite to balance its weight efficiency and durability. Each component finds its place through careful consideration, ensuring stability in microgravity and vibrations caused by the launch. Many aspects of the entire spacecraft are tied together by us.\nThe team is currently working on designs that will support internal components, such as the batteries, PCBA's and startracker. This involves 3D modelling, prototyping, and a ton of iterations!\nOpto-Mechanical\nOpto-Mechanical\nOpto-Mechanical is the team dedicated to the optomechanics of the FINCH Eye payload, integrating the payload to the larger satellite, while holding all optical components aligned and protecting them from damage during launch. Not only must all the optical components be mounted securely along the optical axis at precise spacings and orientations for valuable imaging output - requiring design of the housing itself and the optical mounts within the housing - but the payload must be pointing down the the -z axis with great accuracy. Payload Mechanical is also responsible for ensuring the housing structure can be easily and safely assembled, and that it will survive the large accelerations, vibrations and shock experienced during launch.\nAt present, Payload Mechanical is: wrapping up its parametric, detailed design, ready to have final values inputted; prototyping the housing and iterating upon the payload integration and housing assembly plan; running structural simulations (using ANSYS software) to verify the stresses and displacements experienced under various launch conditions are safe; and working closely with the\nOptics\nand\nThermal\nteams to ensure the optics are not damaged or negatively impacted from thermal and structural effects combined (STOP Analysis)\nADCS\nADCS\nAttitude Determination and Control System (ADCS) is responsible for controlling the orientation of FINCH in space, this is critical to the mission as it allows us to complete the maneuvers required to capture images, downlink information, and calibrate the camera. The maneuver that imposes the largest requirement is image capture, from that the mission has a point requirement of 0.6 degrees and a knowledge of 0.002 degrees.\nCurrent projects:\nAttitude Planing\nADCS Testbed design\nTestbed structure\nTestbed electrical\nTesting procedures\nSystems support and vendor connection\nThermal\nThermal\nThe thermal team is responsible for ensuring that the satellite can comfortably operate in the environment of space. Every component has a temperature tolerance and its our job to make sure these components stay in their nominal range. As an imaging satellite, FINCH houses a camera which must also be characterized for thermo-mechanical distortions (i.e.\nSTOP Analysis\n). This involves running extensive simulations, creating candidate designs, and testing these designs in the real world.\nThe current design consists of a sensing block and a control block. The sensing block encompasses all the temperature telemetry collected from temperature sensors and help the team monitor system health on FINCH. The control block helps maintain a set temperature range. The current design includes active elements such as heaters and Peltier coolers, as well as passive elements such as thermo-optical surface tapes. With collaboration from other subsystems, the thermal team researches, selects, validates, and integrates the entirety of the design.\nElectrical\nElectrical\nThe electrical team handles everything that involves electrons! Our primary responsibilities are the design, test and integration of the onboard computer, the payload computer, and the electrical power system (covered below). We also must integrate with off the shelf components such as the radio module and the ADCS module. Once everything is connected up, we need to make sure that it all performs as expected in the wide range of operating conditions that we expect in space.\nThe current high level design can be found here:\nElectrical System Diagram\n. I’d just put them here, but a picture is worth a thousand words which is longer than the two paragraphs that I was allocated. We use these diagrams to inform what needs to go on each printed circuit board and what kind of information needs to transfer between systems. The design of the board is only half the work though — after getting the boards manufactured, we validate them to make sure they do what we expect, and work with other teams (primarily firmware) to ensure compatibility between systems.\nPower\nPower\nFINCH’s Electrical Power System (EPS) is responsible for the generation, storage, and control of all the power that flows through the satellite. Our aim is to provide the voltage and current required to power the thermal camera, the ADCS sensors, the on-board data processing chip, and the communication (RF) system that will allow us to transmit data to our ground station. Everything needs power, and somebody has to keep the lights on!\nOur system contains:\n6 solar panel cells and an algorithm that harvest solar energy,\n4 lithium-ion batteries and a chip to monitor them,\non-off switches for each device on board that needs power,\nvoltage and current monitors that report back to the on-board computer (OBC),\na fancy fuse to protect the satellite,\nand more!\nJust like the other electrical teams (whom we work closely with), we make printed circuit boards for each of these different components, manufacture them, and test them.\nFirmware\nFirmware\nWe’re basically the coding team. Firmware is responsible for designing the low-level software that will control the hardware components of the satellite and help them communicate with each other. We write code that will execute commands that will control the ADCS sensors, the on-board computer (OBC), the thermal control system, the RF transceiver, so that we can execute our mission operations effectively. We interface with the higher-level flight code so that the applications we write can directly command the hardware.\nOur design mainly revolves around writing C code that can receive and transmit data to several hardware peripherals. These inter  faces are controlled by the flight code, which will determine the satellite’s current mode of operation and execute commands based on what we want the satellite to do. Our C code controls real-time clocks, flash memory chips, thermistors, and any of the other hardware that you’ve read on this page before!\nCommand & Data Handling\nOut satellite consists of a number of microcontrollers (MCU) and peripherals, such as the ADCS system, that our OBC will need to send and receive commands and data to and from. We have very tight computational and memory constraints, and we need to write optimized and fast code to ensure all the tasks on the satellite are completed, such as downlinking and compression, when we intend. This includes interfacing with all peripherals and MCUs, and ensuring the correctness of all data sent and received.\nOur framework consists of a real-time operating system called FreeRTOS, which will support all the threading and synchronization functionality on the satellite. This is very important since we might have multiple tasks wanting to run at the same time and editing the same data, so the operating system manages the resources to allow everything to run safely. We are also using a communications library called CubeSat Space Protocol (CSP) to communicate on each microcontroller between the threads and across chips. We design and implement the code’s architecture, data and program integrity, and all system functionality to do with the handling of commands and data.\nPayload Firmware\nPayload Firmware\nThe Payload Firmware Team is responsible for equipping our satellite, FINCH, with the capability of taking pictures! More specifically, we develop firmware to command the camera to capture images, apply lossless compression, store data on an external storage device, and prepare for data transmission to Earth.\nOur system consists of\nCamera (Image Sensor) - captures images\nSD Card - provides storage for the captured images\nCamera Controller (Firmware) - manages the camera operations\nStorage Controller (Firmware) - reads/writes to external storage device(s)\nCompression Module (Firmware) - handles lossless image compression\nCommand Receiver - accepts commands from the Onboard Computer\nAnd more!\nMission Operations\nMission Operations\nNo access\nThe Mission Operations Team is responsible for defining the modes of operation of FINCH, developing the ground-station and leading FDIR (Fault Detection Isolation and Recovery). Post-launch, the Mission Ops team is responsible for the operation of mission control. The requirements driving our team relies on every subsystem and embodies the overall function of FINCH and how it is supposed to operate and perform in space. Our focus is on ensuring that FINCH meets its scientific and exploration objectives while maintaining the highest standards of safety and reliability.\nFor the development of our ground-station and mission control, our framework is based on NASA’s OpenMCT. OpenMCT provides a flexible and adaptable framework for real-time data visualization, which is crucial for effective monitoring and control of the FINCH spacecraft. Moreover, a significant portion of our work is dedicated to the development of Fault Detection, Isolation, and Recovery (FDIR) protocols which involves a rigorous process of identifying and preparing for potential faults that may arise post-launch, ensuring that we are equipped to address any challenges swiftly and effectively. Finally, our work also consists of refining and implementing the operational modes of FINCH. This critical aspect of our work ensures that every mode is precisely designed and seamlessly integrated, allowing the spacecraft to perform optimally under various conditions and stages of its mission.\nData Processing\nData Processing\nThe data processing team is responsible for bringing the data collected from FINCH from its raw state just after it has been downlinked to a state where it is ready to be used for scientific applications. Many of the requirements driving the team relate to augmenting the existing abilities of the satellite using capabilities on the ground, such as increasing spatial resolution or refining image positioning on the Earth’s surface.\nThe primary design the team is developing is the data processing pipeline. This pipeline currently includes 9 main steps that correct for radiometric (digital) and geometric (spatial) defects in the data and will incorporate data from additional tests that characterize the sensor and other aspects of the satellite.\nM\nMario Ghio Neto\nSep 16\nThis should change!\nShow 3 replies\nS\nSakeena Qureshi\nSep 19\nI will fix the drawio\n​",
    "Space System List of Teams": "Teams | Active\nJavaScript must be enabled in order to use Notion.\nPlease enable JavaScript to continue.\nSkip to content\nUTAT Space Systems\nTeams\nGet Notion free\nHide description\nTeams\nTeam homepages.\nActive\nDecomissioned\nTable\nNo Mission\nRecruitment\nFinance\nAleksandr Osokin\nNicholas Palin\nIT\nSwarnava Ghosh\nConferencing\nMedia\nRiaab Zahid\nFinance and Business Development\nProject Management\nGauri Karajagi\nOutreach\nHannah Chua\nEvents\nSan Vo\nFINCH\nRF / Ground Station\nSwarnava Ghosh\nFINCH\nMission Operations\nMax Michet\nRiaab Zahid\nFINCH\nOptics\nIlya S\nFINCH\nFirmware\nAlex Apostolu\nFINCH\nSystems\nBen Bornstein\nFINCH\nElectrical\nCoby Silayan\nFINCH\nMechanical\nSakeena Qureshi\nAlessandro Gasparotto\nSan Vo\nFINCH\nOpto-Mechanical\nMario Ghio Neto\nSan Vo\nAlessandro Gasparotto\nSan Vo\nFINCH\nData Processing\nNooh Adnan\nFINCH\nPayload Firmware\nFINCH\nADCS\nJenny Hwang\nFINCH\nScience\nEge Artan\nZoe Augspach\nNoam Tal-Siegel\nFINCH\nThermal\nRiann Po\nFINCH\nPower\nEun Gu Kang\nRoshan Yan\nFINCH\nHERON Mk. II\nGround Station Test - Satellite Candidates\nHERON Mk. II\nHERON Operations\nReid Sox-Harris\nHERON Mk. II\nHERON Regulatory\nReid Sox-Harris\nHERON Mk. II\nHERON AIT\nHERON Mk. II\nHERON Systems\nReid Sox-Harris\nHERON Mk. II\nTable"
}